hack/Ironhack-master/Week 6/Day 5/bbq/app/controllers/barbecues_controller.rb

SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC
---
  def index
    @barbecues = Barbecue.order(:date)