hack/Ironhack-master/Week 6/Day 1/sandwichr-master/app/controllers/sandwich_views_controller.rb

	def index
		@sandwich = Sandwich.all
---
SELECT "sandwiches".* FROM "sandwiches"