hack/Ironhack-master/Week 6/Day 1/sandwichr-master/app/controllers/api/v1/ingredients_controller.rb

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwiches_ingredients" ON "ingredients"."id" = "sandwiches_ingredients"."ingredient_id" WHERE "sandwiches_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]
---
	def index
	  sandwich = Sandwich.find_by(id: params[:sandwich_id])
	  ingredients = sandwich.ingredients.all

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
	  ingredient = Ingredient.find_by(id: params[:id])