hack/Ironhack-master/Week 6/Day 1/sandwichr-master/app/controllers/api/v1/sandwiches_controller.rb

	def add
		sandwich = Sandwich.find_by(id: params[:sandwich_id])
		unless sandwich
			render json: {error: "sandwich not found"}, status: 404
	    		return
		end
		ingredient = Ingredient.find_by(id: params[:id])
		unless ingredient
			render json: {error: "ingredient not found"}, status: 404
	    		return
		end
		sandwich.ingredients.push(ingredient)
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "sandwiches" SET "total_calories" = ?, "updated_at" = ? WHERE "sandwiches"."id" = ?  [["total_calories", 5], ["updated_at", "2016-07-11 17:06:06.108038"], ["id", 1]]

	def show
	  sandwich = Sandwich.find_by(id: params[:id])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]